tutorials/old/shockTube/shockTubeIncredibleSolver/Allrun
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application name
application="incredibleSolver"

runApplication blockMesh
runApplication $application
